spec/fixtures/vcr_cassettes/Payment/_cancel_payment_intent/cancel_valid_payment_intent/returns_a_PaymentIntent.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/payment_intents
    body:
      encoding: UTF-8
      string: amount=1000&currency=usd&automatic_payment_methods[enabled]=true&description=FnF+Summer+Campout+VII+Tickets&metadata[event_name]=FnF+Summer+Campout+VII
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/11.7.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2024-04-10'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"11.7.0","lang":"ruby","lang_version":"3.3.5 p100 (2024-09-03)","platform":"arm64-darwin23","engine":"ruby","publisher":"stripe","uname":"Darwin
        matt.studio.lan 23.6.0 Darwin Kernel Version 23.6.0: Mon Jul 29 21:14:30 PDT
        2024; root:xnu-10063.141.2~1/RELEASE_ARM64_T6000 arm64","hostname":"matt.studio.lan"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 03 Oct 2024 20:47:28 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1649'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET,HEAD,PUT,PATCH,POST,DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - report-uri https://q.stripe.com/csp-report?p=v1%2Fpayment_intents; block-all-mixed-content;
        default-src 'none'; base-uri 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'
      Cross-Origin-Opener-Policy-Report-Only:
      - same-origin; report-to="coop"
      Idempotency-Key:
      - c742c631-4ad9-49a2-b5ce-a28b93e0c950
      Original-Request:
      - req_k3cVRN5QdKDXCu
      Report-To:
      - '{"group":"coop","max_age":8640,"endpoints":[{"url":"https://q.stripe.com/coop-report?s=payins-bapi-srv"}],"include_subdomains":true}'
      Reporting-Endpoints:
      - coop="https://q.stripe.com/coop-report?s=payins-bapi-srv"
      Request-Id:
      - req_k3cVRN5QdKDXCu
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - '2024-04-10'
      Vary:
      - Origin
      X-Content-Type-Options:
      - nosniff
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - A
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "pi_3Q5vvo4ofUrW5ZY40FouWwnL",
          "object": "payment_intent",
          "amount": 1000,
          "amount_capturable": 0,
          "amount_details": {
            "tip": {}
          },
          "amount_received": 0,
          "application": null,
          "application_fee_amount": null,
          "automatic_payment_methods": {
            "allow_redirects": "always",
            "enabled": true
          },
          "canceled_at": null,
          "cancellation_reason": null,
          "capture_method": "automatic_async",
          "client_secret": "pi_3Q5vvo4ofUrW5ZY40FouWwnL_secret_oMXXIgsW6WQPgLVmBEzfrAxOp",
          "confirmation_method": "automatic",
          "created": 1727988448,
          "currency": "usd",
          "customer": null,
          "description": "FnF Summer Campout VII Tickets",
          "invoice": null,
          "last_payment_error": null,
          "latest_charge": null,
          "livemode": false,
          "metadata": {
            "event_name": "FnF Summer Campout VII"
          },
          "next_action": null,
          "on_behalf_of": null,
          "payment_method": null,
          "payment_method_configuration_details": {
            "id": "pmc_1PFOE44ofUrW5ZY4cN1kE0il",
            "parent": null
          },
          "payment_method_options": {
            "amazon_pay": {
              "express_checkout_element_session_id": null
            },
            "card": {
              "installments": null,
              "mandate_options": null,
              "network": null,
              "request_three_d_secure": "automatic"
            },
            "cashapp": {}
          },
          "payment_method_types": [
            "card",
            "cashapp",
            "amazon_pay"
          ],
          "processing": null,
          "receipt_email": null,
          "review": null,
          "setup_future_usage": null,
          "shipping": null,
          "source": null,
          "statement_descriptor": null,
          "statement_descriptor_suffix": null,
          "status": "requires_payment_method",
          "transfer_data": null,
          "transfer_group": null
        }
  recorded_at: Thu, 03 Oct 2024 20:47:28 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/payment_intents/pi_3Q5vvo4ofUrW5ZY40FouWwnL/cancel
    body:
      encoding: UTF-8
      string: cancellation_reason=requested_by_customer
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/11.7.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_k3cVRN5QdKDXCu","request_duration_ms":467}}'
      Stripe-Version:
      - '2024-04-10'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"11.7.0","lang":"ruby","lang_version":"3.3.5 p100 (2024-09-03)","platform":"arm64-darwin23","engine":"ruby","publisher":"stripe","uname":"Darwin
        matt.studio.lan 23.6.0 Darwin Kernel Version 23.6.0: Mon Jul 29 21:14:30 PDT
        2024; root:xnu-10063.141.2~1/RELEASE_ARM64_T6000 arm64","hostname":"matt.studio.lan"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 03 Oct 2024 20:47:28 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1659'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET,HEAD,PUT,PATCH,POST,DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - report-uri https://q.stripe.com/csp-report?p=v1%2Fpayment_intents%2F%3Aintent%2Fcancel;
        block-all-mixed-content; default-src 'none'; base-uri 'none'; form-action
        'none'; frame-ancestors 'none'; img-src 'self'; script-src 'self' 'report-sample';
        style-src 'self'
      Cross-Origin-Opener-Policy-Report-Only:
      - same-origin; report-to="coop"
      Idempotency-Key:
      - dbe4cf1f-3026-48c8-863e-b349a65e304d
      Original-Request:
      - req_Ggjag4wzWTcT1Z
      Report-To:
      - '{"group":"coop","max_age":8640,"endpoints":[{"url":"https://q.stripe.com/coop-report?s=payins-bapi-srv"}],"include_subdomains":true}'
      Reporting-Endpoints:
      - coop="https://q.stripe.com/coop-report?s=payins-bapi-srv"
      Request-Id:
      - req_Ggjag4wzWTcT1Z
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - '2024-04-10'
      Vary:
      - Origin
      X-Content-Type-Options:
      - nosniff
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - A
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "pi_3Q5vvo4ofUrW5ZY40FouWwnL",
          "object": "payment_intent",
          "amount": 1000,
          "amount_capturable": 0,
          "amount_details": {
            "tip": {}
          },
          "amount_received": 0,
          "application": null,
          "application_fee_amount": null,
          "automatic_payment_methods": {
            "allow_redirects": "always",
            "enabled": true
          },
          "canceled_at": 1727988448,
          "cancellation_reason": "requested_by_customer",
          "capture_method": "automatic_async",
          "client_secret": "pi_3Q5vvo4ofUrW5ZY40FouWwnL_secret_oMXXIgsW6WQPgLVmBEzfrAxOp",
          "confirmation_method": "automatic",
          "created": 1727988448,
          "currency": "usd",
          "customer": null,
          "description": "FnF Summer Campout VII Tickets",
          "invoice": null,
          "last_payment_error": null,
          "latest_charge": null,
          "livemode": false,
          "metadata": {
            "event_name": "FnF Summer Campout VII"
          },
          "next_action": null,
          "on_behalf_of": null,
          "payment_method": null,
          "payment_method_configuration_details": {
            "id": "pmc_1PFOE44ofUrW5ZY4cN1kE0il",
            "parent": null
          },
          "payment_method_options": {
            "amazon_pay": {
              "express_checkout_element_session_id": null
            },
            "card": {
              "installments": null,
              "mandate_options": null,
              "network": null,
              "request_three_d_secure": "automatic"
            },
            "cashapp": {}
          },
          "payment_method_types": [
            "card",
            "cashapp",
            "amazon_pay"
          ],
          "processing": null,
          "receipt_email": null,
          "review": null,
          "setup_future_usage": null,
          "shipping": null,
          "source": null,
          "statement_descriptor": null,
          "statement_descriptor_suffix": null,
          "status": "canceled",
          "transfer_data": null,
          "transfer_group": null
        }
  recorded_at: Thu, 03 Oct 2024 20:47:28 GMT
recorded_with: VCR 6.3.1
